Config/Documents/ИнвентаризацияЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияЦенныхБумаг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаИФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеннойБумаги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъяснениеПричинРасхождений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиМОЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешениеОПроведенииИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПроведенииИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыФинансовыхВложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>24</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>24</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>24</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзлишки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>24</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьВалютнаяФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьВалютнаяУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьВалютная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьВалютнаяНедостача</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьИзлишки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальнаяСтоимостьВалютнаяИзлишки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсНаДатуВалютирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьНаДатуВалютирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ИнвентаризацияЦенныхБумаг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекстЗаголовкаСообщений;

&НаКлиенте
Перем ДатаНачалаПредыдущая, ДатаОкончанияПредыдущая;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Настраиваем форму
	НастроитьФормуСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Подвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатаНачалаПредыдущая = ТекущийОбъект.ДатаНачала;
	ДатаОкончанияПредыдущая = ТекущийОбъект.ДатаОкончания;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьДанныеВсехСтрокТаблицыЦенныеБумаги(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитСсылка_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура БезУчетаИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитФлажок_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала)
		И ЗначениеЗаполнено(Объект.ДатаОкончания)
		И Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаНачала");
		Объект.ДатаНачала = ДатаНачалаПредыдущая;
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПредыдущая = Объект.ДатаНачала;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала)
		И ЗначениеЗаполнено(Объект.ДатаОкончания)
		И Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru='Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаОкончания");
		Объект.ДатаОкончания = ДатаОкончанияПредыдущая;
		Возврат;
	КонецЕсли;
	
	ДатаОкончанияПредыдущая = Объект.ДатаОкончания;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЦенныеБумаги

&НаКлиенте
Процедура ЦенныеБумагиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	ОбновитьТекстЗаголовковВСтрокеТаблицыЦенныеБумаги(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	ЦенныеБумагиЦеннаяБумагаПриИзмененииНаСервере(Элементы.ЦенныеБумаги.ТекущиеДанные, Объект.ДатаИнвентаризации);
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличествоФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	РассчитатьНедостачиИзлишки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиНоминальнаяФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	РассчитатьНедостачиИзлишки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиНоминальнаяВалютнаяФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	РассчитатьНедостачиИзлишки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Страница "Инвентаризация"
&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	
	Диалог.Показать(Новый ОписаниеОповещения("ПослеВыбораПериодаИнвентаризации", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаИнвентаризации(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	ДатаНачалаПредыдущая = Период.ДатаНачала;
	ДатаОкончанияПредыдущая = Период.ДатаОкончания;
	
	ЭтаФорма.Модифицированность = Истина;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборПредседателяКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ИнвентаризацияКлиент.ОткрытьПодборКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	Если НЕ НеобходимыеРеквизитыЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект["ЦенныеБумаги"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением по данным учета будет очищена
		|табличная часть ""Ценные бумаги""
		|
		|Продолжить и очистить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДаннымУчета_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);		
	Иначе
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаКлиент()
	
	ЗаполнитьПоДаннымУчетаНаСервере();
	
	Если Объект["ЦенныеБумаги"].Количество() = 0 Тогда
		Текст = НСтр("ru='Данные учета, соответствующие условиям поиска, отсутствуют'");
		ПоказатьПредупреждение(, Текст, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
	ОбновитьДанныеВсехСтрокТаблицыЦенныеБумаги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымУчетаНаСервере()
	
	Документы.ИнвентаризацияЦенныхБумаг.ЗаполнитьПоДаннымУчета(Объект);
	
	Для Каждого Строка Из Объект.ЦенныеБумаги Цикл
		РассчитатьНедостачиИзлишки(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактПоДаннымБУ(Команда)
	
	Для Каждого ТекСтрока Из Объект.ЦенныеБумаги Цикл
		
		ТекСтрока.КоличествоФакт = ТекСтрока.КоличествоУчет;
		ТекСтрока.НоминальнаяСтоимостьФакт = ТекСтрока.НоминальнаяСтоимостьУчет;
		ТекСтрока.НоминальнаяСтоимостьВалютнаяФакт = ТекСтрока.НоминальнаяСтоимостьВалютнаяУчет;
		
		РассчитатьНедостачиИзлишки(ТекСтрока);
		
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтаФорма, РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер()
	
	ОбновитьДанныеВсехСтрокТаблицыЦенныеБумаги(ЭтотОбъект);
	
	//---
	// Флажок <без ограничения>
	//---
	НастройкиМеханизма = Документы.ИнвентаризацияЦенныхБумаг.ФлажокБезОграничения_ПолучитьНастройкиМеханизма();
	ОбщегоНазначенияБГУ.ФлажокБезОграничения_ИнициализироватьФорму(ЭтаФорма, НастройкиМеханизма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеВсехСтрокТаблицыЦенныеБумаги(Форма)
	
	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.ЦенныеБумаги Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыЦенныеБумаги(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыЦенныеБумаги(ТекущаяСтрока)
	
	ТекущаяСтрока.ЗаголовокНаДатуИнвентаризации = НСтр("ru = 'на дату инвентаризации:'");
	ТекущаяСтрока.ЗаголовокНаДатуВалютирования = НСтр("ru = 'на дату валютирования:'");
	
	ТекущаяСтрока.ЗаголовокКоличество = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокВВалюте = НСтр("ru = 'в валюте:'");
	ТекущаяСтрока.ЗаголовокВРублях = НСтр("ru = 'в рублях:'");
	
	ТекущаяСтрока.ЗаголовокПустой = НСтр("ru = 'Х'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьНедостачиИзлишки(Строка)
	
	Если Строка.КоличествоФакт > Строка.КоличествоУчет Тогда
		Строка.КоличествоИзлишки = Строка.КоличествоФакт - Строка.КоличествоУчет;
		Строка.КоличествоНедостача = 0;
	ИначеЕсли Строка.КоличествоФакт < Строка.КоличествоУчет Тогда
		Строка.КоличествоИзлишки = 0;
		Строка.КоличествоНедостача = Строка.КоличествоУчет - Строка.КоличествоФакт;
	Иначе
		Строка.КоличествоИзлишки = 0;
		Строка.КоличествоНедостача = 0;
	КонецЕсли;
	
	Если Строка.НоминальнаяСтоимостьФакт > Строка.НоминальнаяСтоимостьУчет Тогда
		Строка.НоминальнаяСтоимостьИзлишки = Строка.НоминальнаяСтоимостьФакт - Строка.НоминальнаяСтоимостьУчет;
		Строка.НоминальнаяСтоимостьНедостача = 0;
	ИначеЕсли Строка.НоминальнаяСтоимостьФакт < Строка.НоминальнаяСтоимостьУчет Тогда
		Строка.НоминальнаяСтоимостьИзлишки = 0;
		Строка.НоминальнаяСтоимостьНедостача = Строка.НоминальнаяСтоимостьУчет - Строка.НоминальнаяСтоимостьФакт;
	Иначе
		Строка.НоминальнаяСтоимостьИзлишки = 0;
		Строка.НоминальнаяСтоимостьНедостача = 0;
	КонецЕсли;
	
	Если Строка.НоминальнаяСтоимостьВалютнаяФакт > Строка.НоминальнаяСтоимостьВалютнаяУчет Тогда
		Строка.НоминальнаяСтоимостьВалютнаяИзлишки = Строка.НоминальнаяСтоимостьВалютнаяФакт - Строка.НоминальнаяСтоимостьВалютнаяУчет;
		Строка.НоминальнаяСтоимостьВалютнаяНедостача = 0;
	ИначеЕсли Строка.НоминальнаяСтоимостьВалютнаяФакт < Строка.НоминальнаяСтоимостьВалютнаяУчет Тогда
		Строка.НоминальнаяСтоимостьВалютнаяИзлишки = 0;
		Строка.НоминальнаяСтоимостьВалютнаяНедостача = Строка.НоминальнаяСтоимостьВалютнаяУчет - Строка.НоминальнаяСтоимостьВалютнаяФакт;
	Иначе
		Строка.НоминальнаяСтоимостьВалютнаяИзлишки = 0;
		Строка.НоминальнаяСтоимостьВалютнаяНедостача = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ЕстьДанные = (Объект["ЦенныеБумаги"].Количество() > 0);
	Если ЕстьДанные Тогда
		
		ТекстВопроса = НСтр("ru='При изменении периода рекомендуется очистить табличную часть.
			|
			|Продолжить и очистить табличную часть?'");
			
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПриИзмененииПериода_Ответ", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		// Очищаем таблицы:
		Объект["Задолженность"].Очистить();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаИнвентаризации) Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не указана дата проведения инвентаризации'"),
			Объект["Ссылка"],
			"Объект.ДатаИнвентаризации");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле Организация не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Объект.МОЛ) Тогда
	//	Результат = Ложь;
	//	ТекстСообщения = НСтр("ru='Поле ""Ответственное лицо"" не заполнено'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
	//		Объект.Ссылка,
	//		"Объект.МОЛ");
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЦенныеБумагиЦеннаяБумагаПриИзмененииНаСервере(Строка,Знач ДатаКурса)
	
	ВалютаЦеннойБумагиИКурс = ВалютаЦеннойБумагиИКурс(Строка.ЦеннаяБумага, ДатаКурса);
	
	Строка.Валюта = ВалютаЦеннойБумагиИКурс.Валюта;
	
	Строка.Курс = ВалютаЦеннойБумагиИКурс.Курс;
	Строка.Кратность = ВалютаЦеннойБумагиИКурс.Кратность;
	Строка.КурсНаДатуВалютирования = ВалютаЦеннойБумагиИКурс.Курс;
	Строка.КратностьНаДатуВалютирования = ВалютаЦеннойБумагиИКурс.Кратность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВалютаЦеннойБумагиИКурс(ЦеннаяБумага, ДатаКурса)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Валюта", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага, "Валюта"));
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Результат.Валюта, ДатаКурса);
	
	Результат.Вставить("Курс", КурсВалюты.Курс);
	Результат.Вставить("Кратность", КурсВалюты.Кратность);
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
